node {
  name: "input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 331
        }
        dim {
          size: 331
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "conv0/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000`\000\000\000"
      }
    }
  }
}
node {
  name: "conv0/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "conv0/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.054856713861227036
      }
    }
  }
}
node {
  name: "conv0/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "conv0/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "conv0/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "conv0/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "conv0/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0/weights"
      }
    }
  }
}
node {
  name: "conv0/weights/Initializer/truncated_normal"
  op: "Add"
  input: "conv0/weights/Initializer/truncated_normal/mul"
  input: "conv0/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0/weights"
      }
    }
  }
}
node {
  name: "conv0/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 96
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv0/weights/Assign"
  op: "Assign"
  input: "conv0/weights"
  input: "conv0/weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv0/weights/read"
  op: "Identity"
  input: "conv0/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0/weights"
      }
    }
  }
}
node {
  name: "conv0/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "conv0/Conv2D"
  op: "Conv2D"
  input: "input"
  input: "conv0/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "conv0_bn/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 96
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv0_bn/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 96
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv0_bn/gamma/Assign"
  op: "Assign"
  input: "conv0_bn/gamma"
  input: "conv0_bn/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv0_bn/gamma/read"
  op: "Identity"
  input: "conv0_bn/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/gamma"
      }
    }
  }
}
node {
  name: "conv0_bn/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 96
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "conv0_bn/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 96
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv0_bn/beta/Assign"
  op: "Assign"
  input: "conv0_bn/beta"
  input: "conv0_bn/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv0_bn/beta/read"
  op: "Identity"
  input: "conv0_bn/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/beta"
      }
    }
  }
}
node {
  name: "conv0_bn/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 96
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "conv0_bn/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 96
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv0_bn/moving_mean/Assign"
  op: "Assign"
  input: "conv0_bn/moving_mean"
  input: "conv0_bn/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv0_bn/moving_mean/read"
  op: "Identity"
  input: "conv0_bn/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv0_bn/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 96
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv0_bn/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 96
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv0_bn/moving_variance/Assign"
  op: "Assign"
  input: "conv0_bn/moving_variance"
  input: "conv0_bn/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv0_bn/moving_variance/read"
  op: "Identity"
  input: "conv0_bn/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv0_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv0_bn/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "conv0/Conv2D"
  input: "conv0_bn/gamma/read"
  input: "conv0_bn/beta/read"
  input: "conv0_bn/moving_mean/read"
  input: "conv0_bn/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "conv0_bn/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.9997000098228455
      }
    }
  }
}
node {
  name: "cell_stem_0/Relu"
  op: "Relu"
  input: "conv0_bn/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "cell_stem_0/1x1/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/1x1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000`\000\000\0006\000\000\000"
      }
    }
  }
}
node {
  name: "cell_stem_0/1x1/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/1x1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "cell_stem_0/1x1/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/1x1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.21942685544490814
      }
    }
  }
}
node {
  name: "cell_stem_0/1x1/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "cell_stem_0/1x1/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/1x1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "cell_stem_0/1x1/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "cell_stem_0/1x1/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "cell_stem_0/1x1/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/1x1/weights"
      }
    }
  }
}
node {
  name: "cell_stem_0/1x1/weights/Initializer/truncated_normal"
  op: "Add"
  input: "cell_stem_0/1x1/weights/Initializer/truncated_normal/mul"
  input: "cell_stem_0/1x1/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/1x1/weights"
      }
    }
  }
}
node {
  name: "cell_stem_0/1x1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/1x1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 96
        }
        dim {
          size: 54
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "cell_stem_0/1x1/weights/Assign"
  op: "Assign"
  input: "cell_stem_0/1x1/weights"
  input: "cell_stem_0/1x1/weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/1x1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "cell_stem_0/1x1/weights/read"
  op: "Identity"
  input: "cell_stem_0/1x1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/1x1/weights"
      }
    }
  }
}
node {
  name: "cell_stem_0/1x1/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "cell_stem_0/1x1/Conv2D"
  op: "Conv2D"
  input: "cell_stem_0/Relu"
  input: "cell_stem_0/1x1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 54
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 54
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/gamma/Assign"
  op: "Assign"
  input: "cell_stem_0/beginning_bn/gamma"
  input: "cell_stem_0/beginning_bn/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/gamma/read"
  op: "Identity"
  input: "cell_stem_0/beginning_bn/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/gamma"
      }
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 54
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 54
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/beta/Assign"
  op: "Assign"
  input: "cell_stem_0/beginning_bn/beta"
  input: "cell_stem_0/beginning_bn/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/beta/read"
  op: "Identity"
  input: "cell_stem_0/beginning_bn/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/beta"
      }
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 54
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 54
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/moving_mean/Assign"
  op: "Assign"
  input: "cell_stem_0/beginning_bn/moving_mean"
  input: "cell_stem_0/beginning_bn/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/moving_mean/read"
  op: "Identity"
  input: "cell_stem_0/beginning_bn/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/moving_mean"
      }
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 54
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 54
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/moving_variance/Assign"
  op: "Assign"
  input: "cell_stem_0/beginning_bn/moving_variance"
  input: "cell_stem_0/beginning_bn/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/moving_variance/read"
  op: "Identity"
  input: "cell_stem_0/beginning_bn/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/beginning_bn/moving_variance"
      }
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "cell_stem_0/1x1/Conv2D"
  input: "cell_stem_0/beginning_bn/gamma/read"
  input: "cell_stem_0/beginning_bn/beta/read"
  input: "cell_stem_0/beginning_bn/moving_mean/read"
  input: "cell_stem_0/beginning_bn/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "cell_stem_0/beginning_bn/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.9997000098228455
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/Relu"
  op: "Relu"
  input: "conv0_bn/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000`\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.32249030470848083
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/Initializer/truncated_normal/TruncatedNormal"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights"
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/Initializer/truncated_normal"
  op: "Add"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/Initializer/truncated_normal/mul"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights"
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 96
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/Assign"
  op: "Assign"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/read"
  op: "Identity"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights"
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000`\000\000\0006\000\000\000"
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.21942685544490814
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/Initializer/truncated_normal/TruncatedNormal"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights"
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/Initializer/truncated_normal"
  op: "Add"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/Initializer/truncated_normal/mul"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights"
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 96
        }
        dim {
          size: 54
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/Assign"
  op: "Assign"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/read"
  op: "Identity"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights"
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/separable_conv2d/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000`\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/separable_conv2d/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "cell_stem_0/comb_iter_0/left/Relu"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_1/separable_conv2d"
  op: "Conv2D"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/separable_conv2d/depthwise"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 54
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 54
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/gamma/Assign"
  op: "Assign"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/gamma"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/gamma/read"
  op: "Identity"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/gamma"
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 54
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 54
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/beta/Assign"
  op: "Assign"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/beta"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/beta/read"
  op: "Identity"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/beta"
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 54
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 54
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_mean/Assign"
  op: "Assign"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_mean"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_mean/read"
  op: "Identity"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_mean"
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 54
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 54
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_variance/Assign"
  op: "Assign"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_variance"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_variance/read"
  op: "Identity"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_variance"
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_1/separable_conv2d"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/gamma/read"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/beta/read"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_mean/read"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.9997000098228455
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/Relu_1"
  op: "Relu"
  input: "cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_2/depthwise_weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_2/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\0006\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_2/depthwise_weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_2/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_2/depthwise_weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@cell_stem_0/comb_iter_0/left/separable_5x5_2/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.32249030470848083
      }
    }
  }
}
node {
  name: "cell_stem_0/comb_iter_0/left/separable_5x5_2/depthwise_weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "cell_stem_0/comb_iter_0/left/separable_5x5_2/depthwise_weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
