node {
  name: "input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 299
        }
        dim {
          size: 299
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.1380131095647812
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.1380131095647812
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "InceptionResnetV2/Conv2d_1a_3x3/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "InceptionResnetV2/Conv2d_1a_3x3/weights/Initializer/random_uniform/max"
  input: "InceptionResnetV2/Conv2d_1a_3x3/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "InceptionResnetV2/Conv2d_1a_3x3/weights/Initializer/random_uniform/RandomUniform"
  input: "InceptionResnetV2/Conv2d_1a_3x3/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/weights/Initializer/random_uniform"
  op: "Add"
  input: "InceptionResnetV2/Conv2d_1a_3x3/weights/Initializer/random_uniform/mul"
  input: "InceptionResnetV2/Conv2d_1a_3x3/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/weights/Assign"
  op: "Assign"
  input: "InceptionResnetV2/Conv2d_1a_3x3/weights"
  input: "InceptionResnetV2/Conv2d_1a_3x3/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/weights/read"
  op: "Identity"
  input: "InceptionResnetV2/Conv2d_1a_3x3/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_1a_3x3/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_1a_3x3/Conv2D"
  op: "Conv2D"
  input: "input"
  input: "InceptionResnetV2/Conv2d_1a_3x3/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/beta/Assign"
  op: "Assign"
  input: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/beta"
  input: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/beta/read"
  op: "Identity"
  input: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_mean/Assign"
  op: "Assign"
  input: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_mean"
  input: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_variance/Assign"
  op: "Assign"
  input: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_variance"
  input: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "InceptionResnetV2/InceptionResnetV2/Conv2d_1a_3x3/Conv2D"
  input: "InceptionResnetV2/InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/Const"
  input: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/beta/read"
  input: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_mean/read"
  input: "InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.9997000098228455
      }
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_1a_3x3/Relu"
  op: "Relu"
  input: "InceptionResnetV2/InceptionResnetV2/Conv2d_1a_3x3/BatchNorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000 \000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.10206207633018494
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10206207633018494
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "InceptionResnetV2/Conv2d_2a_3x3/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "InceptionResnetV2/Conv2d_2a_3x3/weights/Initializer/random_uniform/max"
  input: "InceptionResnetV2/Conv2d_2a_3x3/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "InceptionResnetV2/Conv2d_2a_3x3/weights/Initializer/random_uniform/RandomUniform"
  input: "InceptionResnetV2/Conv2d_2a_3x3/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/weights/Initializer/random_uniform"
  op: "Add"
  input: "InceptionResnetV2/Conv2d_2a_3x3/weights/Initializer/random_uniform/mul"
  input: "InceptionResnetV2/Conv2d_2a_3x3/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/weights/Assign"
  op: "Assign"
  input: "InceptionResnetV2/Conv2d_2a_3x3/weights"
  input: "InceptionResnetV2/Conv2d_2a_3x3/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/weights/read"
  op: "Identity"
  input: "InceptionResnetV2/Conv2d_2a_3x3/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_2a_3x3/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_2a_3x3/Conv2D"
  op: "Conv2D"
  input: "InceptionResnetV2/InceptionResnetV2/Conv2d_1a_3x3/Relu"
  input: "InceptionResnetV2/Conv2d_2a_3x3/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/beta/Assign"
  op: "Assign"
  input: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/beta"
  input: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/beta/read"
  op: "Identity"
  input: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_mean/Assign"
  op: "Assign"
  input: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_mean"
  input: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_variance/Assign"
  op: "Assign"
  input: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_variance"
  input: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "InceptionResnetV2/InceptionResnetV2/Conv2d_2a_3x3/Conv2D"
  input: "InceptionResnetV2/InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/Const"
  input: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/beta/read"
  input: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_mean/read"
  input: "InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.9997000098228455
      }
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_2a_3x3/Relu"
  op: "Relu"
  input: "InceptionResnetV2/InceptionResnetV2/Conv2d_2a_3x3/BatchNorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000 \000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.0833333358168602
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0833333358168602
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "InceptionResnetV2/Conv2d_2b_3x3/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "InceptionResnetV2/Conv2d_2b_3x3/weights/Initializer/random_uniform/max"
  input: "InceptionResnetV2/Conv2d_2b_3x3/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "InceptionResnetV2/Conv2d_2b_3x3/weights/Initializer/random_uniform/RandomUniform"
  input: "InceptionResnetV2/Conv2d_2b_3x3/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/weights/Initializer/random_uniform"
  op: "Add"
  input: "InceptionResnetV2/Conv2d_2b_3x3/weights/Initializer/random_uniform/mul"
  input: "InceptionResnetV2/Conv2d_2b_3x3/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/weights/Assign"
  op: "Assign"
  input: "InceptionResnetV2/Conv2d_2b_3x3/weights"
  input: "InceptionResnetV2/Conv2d_2b_3x3/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/weights/read"
  op: "Identity"
  input: "InceptionResnetV2/Conv2d_2b_3x3/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_2b_3x3/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_2b_3x3/Conv2D"
  op: "Conv2D"
  input: "InceptionResnetV2/InceptionResnetV2/Conv2d_2a_3x3/Relu"
  input: "InceptionResnetV2/Conv2d_2b_3x3/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/beta/Assign"
  op: "Assign"
  input: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/beta"
  input: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/beta/read"
  op: "Identity"
  input: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_mean/Assign"
  op: "Assign"
  input: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_mean"
  input: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_variance/Assign"
  op: "Assign"
  input: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_variance"
  input: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "InceptionResnetV2/InceptionResnetV2/Conv2d_2b_3x3/Conv2D"
  input: "InceptionResnetV2/InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/Const"
  input: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/beta/read"
  input: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_mean/read"
  input: "InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.9997000098228455
      }
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_2b_3x3/Relu"
  op: "Relu"
  input: "InceptionResnetV2/InceptionResnetV2/Conv2d_2b_3x3/BatchNorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/MaxPool_3a_3x3/MaxPool"
  op: "MaxPool"
  input: "InceptionResnetV2/InceptionResnetV2/Conv2d_2b_3x3/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_3b_1x1/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_3b_1x1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000@\000\000\000P\000\000\000"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_3b_1x1/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_3b_1x1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.20412415266036987
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_3b_1x1/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_3b_1x1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20412415266036987
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_3b_1x1/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "InceptionResnetV2/Conv2d_3b_1x1/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_3b_1x1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_3b_1x1/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "InceptionResnetV2/Conv2d_3b_1x1/weights/Initializer/random_uniform/max"
  input: "InceptionResnetV2/Conv2d_3b_1x1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_3b_1x1/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_3b_1x1/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "InceptionResnetV2/Conv2d_3b_1x1/weights/Initializer/random_uniform/RandomUniform"
  input: "InceptionResnetV2/Conv2d_3b_1x1/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_3b_1x1/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_3b_1x1/weights/Initializer/random_uniform"
  op: "Add"
  input: "InceptionResnetV2/Conv2d_3b_1x1/weights/Initializer/random_uniform/mul"
  input: "InceptionResnetV2/Conv2d_3b_1x1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_3b_1x1/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_3b_1x1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_3b_1x1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 64
        }
        dim {
          size: 80
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_3b_1x1/weights/Assign"
  op: "Assign"
  input: "InceptionResnetV2/Conv2d_3b_1x1/weights"
  input: "InceptionResnetV2/Conv2d_3b_1x1/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_3b_1x1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_3b_1x1/weights/read"
  op: "Identity"
  input: "InceptionResnetV2/Conv2d_3b_1x1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_3b_1x1/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_3b_1x1/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_3b_1x1/Conv2D"
  op: "Conv2D"
  input: "InceptionResnetV2/InceptionResnetV2/MaxPool_3a_3x3/MaxPool"
  input: "InceptionResnetV2/Conv2d_3b_1x1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "InceptionResnetV2/InceptionResnetV2/Conv2d_3b_1x1/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 80
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_3b_1x1/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_3b_1x1/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 80
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "InceptionResnetV2/Conv2d_3b_1x1/BatchNorm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV2/Conv2d_3b_1x1/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 80
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
