node {
  name: "input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 224
        }
        dim {
          size: 224
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "resnet_v2_152/Pad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\003\000\000\000\003\000\000\000\003\000\000\000\003\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "resnet_v2_152/Pad"
  op: "Pad"
  input: "input"
  input: "resnet_v2_152/Pad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resnet_v2_152/conv1/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\007\000\000\000\007\000\000\000\003\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "resnet_v2_152/conv1/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v2_152/conv1/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.13299275934696198
      }
    }
  }
}
node {
  name: "resnet_v2_152/conv1/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "resnet_v2_152/conv1/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "resnet_v2_152/conv1/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "resnet_v2_152/conv1/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "resnet_v2_152/conv1/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/conv1/weights"
      }
    }
  }
}
node {
  name: "resnet_v2_152/conv1/weights/Initializer/truncated_normal"
  op: "Add"
  input: "resnet_v2_152/conv1/weights/Initializer/truncated_normal/mul"
  input: "resnet_v2_152/conv1/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/conv1/weights"
      }
    }
  }
}
node {
  name: "resnet_v2_152/conv1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/conv1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
        dim {
          size: 7
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "resnet_v2_152/conv1/weights/Assign"
  op: "Assign"
  input: "resnet_v2_152/conv1/weights"
  input: "resnet_v2_152/conv1/weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/conv1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/conv1/weights/read"
  op: "Identity"
  input: "resnet_v2_152/conv1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/conv1/weights"
      }
    }
  }
}
node {
  name: "resnet_v2_152/conv1/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/conv1/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v2_152/conv1/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/conv1/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "resnet_v2_152/conv1/biases/Assign"
  op: "Assign"
  input: "resnet_v2_152/conv1/biases"
  input: "resnet_v2_152/conv1/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/conv1/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/conv1/biases/read"
  op: "Identity"
  input: "resnet_v2_152/conv1/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/conv1/biases"
      }
    }
  }
}
node {
  name: "resnet_v2_152/conv1/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "resnet_v2_152/conv1/Conv2D"
  op: "Conv2D"
  input: "resnet_v2_152/Pad"
  input: "resnet_v2_152/conv1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/conv1/BiasAdd"
  op: "BiasAdd"
  input: "resnet_v2_152/conv1/Conv2D"
  input: "resnet_v2_152/conv1/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "resnet_v2_152/pool1/MaxPool"
  op: "MaxPool"
  input: "resnet_v2_152/conv1/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/gamma/Assign"
  op: "Assign"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/gamma"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/gamma/read"
  op: "Identity"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/gamma"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/beta/Assign"
  op: "Assign"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/beta"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/beta/read"
  op: "Identity"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/beta"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_mean/Assign"
  op: "Assign"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_mean"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_mean/read"
  op: "Identity"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_mean"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_variance/Assign"
  op: "Assign"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_variance"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_variance/read"
  op: "Identity"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_variance"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "resnet_v2_152/pool1/MaxPool"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/gamma/read"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/beta/read"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_mean/read"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.996999979019165
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/Relu"
  op: "Relu"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000@\000\000\000\000\001\000\000"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20155644416809082
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights/Initializer/truncated_normal"
  op: "Add"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights/Initializer/truncated_normal/mul"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 64
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights/Assign"
  op: "Assign"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights/read"
  op: "Identity"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/biases/Assign"
  op: "Assign"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/biases"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/biases/read"
  op: "Identity"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/biases"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/Conv2D"
  op: "Conv2D"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/Relu"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/BiasAdd"
  op: "BiasAdd"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/Conv2D"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/shortcut/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000@\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20155644416809082
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights/Initializer/truncated_normal"
  op: "Add"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights/Initializer/truncated_normal/mul"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights/Assign"
  op: "Assign"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights/read"
  op: "Identity"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/Conv2D"
  op: "Conv2D"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/preact/Relu"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/gamma/Assign"
  op: "Assign"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/gamma"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/gamma/read"
  op: "Identity"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/gamma"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/beta/Assign"
  op: "Assign"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/beta"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/beta/read"
  op: "Identity"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean/Assign"
  op: "Assign"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance/Assign"
  op: "Assign"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/Conv2D"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/gamma/read"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/beta/read"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean/read"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.996999979019165
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/Relu"
  op: "Relu"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/BatchNorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000@\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.06718548387289047
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights/Initializer/truncated_normal"
  op: "Add"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights/Initializer/truncated_normal/mul"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights/Assign"
  op: "Assign"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights/read"
  op: "Identity"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/Conv2D"
  op: "Conv2D"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv1/Relu"
  input: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/BatchNorm/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "resnet_v2_152/block1/unit_1/bottleneck_v2/conv2/BatchNorm/gamma"
  op: "VariableV2"
  attr {
